deep-diary/xiaozhi-esp32/main/boards/deep-dog/esp_sparkbot_board.cc
#include "wifi_board.h"
#include "codecs/es8311_audio_codec.h"
#include "display/lcd_display.h"
#include "application.h"
#include "button.h"
#include "config.h"
#include "net/net_config.h"
#include "mcp_server.h"
#include "settings.h"
#include "touch_btn/touch_button_controller.h"
#include "touch_btn/touch_event_hub.h"
#include "touch_btn/touch_app_dispatcher.h"
#include "touch_btn/touch_config.h"
#if DEEP_DOG_TOUCH_COMBO_ENABLE
#include "touch_btn/touch_combo_recognizer.h"
#endif
#if DEEP_DOG_TOUCH_APP_LOG_ENABLE
#include "touch_btn/apps/touch_app_log.h"
#endif
#if DEEP_DOG_TOUCH_APP_DOG_ENABLE
#include "touch_btn/apps/touch_app_dog.h"
#endif
#if DEEP_DOG_TOUCH_APP_SERVO_ENABLE
#include "touch_btn/apps/touch_app_servo.h"
#endif

#include "handle/handle_config.h"
#if DEEP_DOG_HANDLE_ENABLE
#include "handle/handle_event_hub.h"
#include "handle/handle_app_dispatcher.h"
#include "handle/sources/handle_bt.h"
#if DEEP_DOG_HANDLE_APP_LOG_ENABLE
#include "handle/apps/handle_app_log.h"
#endif
#if DEEP_DOG_HANDLE_APP_DOG_ENABLE
#include "handle/apps/handle_app_dog.h"
#endif
#if DEEP_DOG_HANDLE_APP_SERVO_ENABLE
#include "handle/apps/handle_app_servo.h"
#endif
#endif

#if DEEP_DOG_CAN_ENABLE
#include "can/can_config.h"
#include "can/ESP32-TWAI-CAN.hpp"
#endif
#if DEEP_DOG_MOTOR_ENABLE
#include "motor/deep_motor.h"
#include "motor/deep_motor_control.h"
#endif
#if DEEP_DOG_DOG_ENABLE
#include "leg/leg_control.h"
#include "dog/dog_control.h"
#endif
#if DEEP_DOG_UART_ENABLE
#include "uart/uart_stub.h"
#endif
#if DEEP_DOG_LED_ENABLE
#include "led/led_init.h"
#include "led/led_mcp.h"
#endif
#if DEEP_DOG_SERVO_ENABLE || DEEP_DOG_GIMBAL_ENABLE
#include "servo/servo_config.h"
#include "servo/servo_control.h"
#include "gimbal/Gimbal.h"
#endif
#if DEEP_DOG_ARM_ENABLE
#include "arm/arm_stub.h"
#endif
#if DEEP_DOG_RS485_ENABLE
#include "rs485/rs485_stub.h"
#endif
#if DEEP_DOG_IO_ENABLE
#include "io_ext/io_ext_stub.h"
#endif
#if DEEP_DOG_AD_ENABLE
#include "ad/ad_stub.h"
#endif

#include <esp_log.h>
#include <esp_lcd_panel_vendor.h>
#include <esp_idf_version.h>
#if DEEP_DOG_WIFI_USE_STATIC_IP
#include <esp_event.h>
#include <esp_netif.h>
#include <esp_wifi.h>
#endif
#include <driver/i2c_master.h>
#include <driver/spi_common.h>
#include <cstring>
#include <memory>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include "i2c_bus.h"
#include "esp_video.h"

#include "vision/vision_config.h"
#include "face_ai_config.h"
#include "sensor/imu_config.h"
#if DEEP_DOG_IMU_ENABLE
#include "sensor/imu_sensor.h"
#include "sensor/imu_switch.h"
#endif

#include <wifi_manager.h>

#if DEEP_DOG_HTTP_SERVER_ENABLE
#include "http-server/http_server_config.h"
#include "http-server/deep_dog_http_server.h"
#if DEEP_DOG_DOG_ENABLE
#include "dog/dog_control.h"
#endif
#endif
#if DEEP_DOG_VISION_HUB_ENABLE
#include "vision/vision_frame_hub.h"
#endif
#if DEEP_DOG_FACE_AI_ENABLE
#include "face_ai_bridge.h"
#endif
#include "mqtt/mqtt_config.h"
#if DEEP_DOG_MQTT_ENABLE
#include "mqtt/deep_dog_mqtt.h"
#endif

#define TAG "deep_dog"

#if DEEP_DOG_WIFI_USE_STATIC_IP
namespace {

esp_event_handler_instance_t s_deep_dog_sta_connected_hook = nullptr;

void DeepDogApplyStaticStaIpv4() {
    esp_netif_t* netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (netif == nullptr) {
        ESP_LOGW(TAG, "静态 IP: 未找到 WIFI_STA_DEF");
        return;
    }
    esp_err_t err = esp_netif_dhcpc_stop(netif);
    if (err != ESP_OK && err != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STOPPED) {
        ESP_LOGW(TAG, "dhcpc_stop: %s", esp_err_to_name(err));
    }

    esp_netif_ip_info_t ip_info = {};
    ip_info.ip.addr = ESP_IP4TOADDR(DEEP_DOG_WIFI_STATIC_IP_O1, DEEP_DOG_WIFI_STATIC_IP_O2, DEEP_DOG_WIFI_STATIC_IP_O3,
                                    DEEP_DOG_WIFI_STATIC_IP_O4);
    ip_info.gw.addr = ESP_IP4TOADDR(DEEP_DOG_WIFI_STATIC_GW_O1, DEEP_DOG_WIFI_STATIC_GW_O2, DEEP_DOG_WIFI_STATIC_GW_O3,
                                    DEEP_DOG_WIFI_STATIC_GW_O4);
    ip_info.netmask.addr = ESP_IP4TOADDR(DEEP_DOG_WIFI_STATIC_NM_O1, DEEP_DOG_WIFI_STATIC_NM_O2,
                                         DEEP_DOG_WIFI_STATIC_NM_O3, DEEP_DOG_WIFI_STATIC_NM_O4);

    err = esp_netif_set_ip_info(netif, &ip_info);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "静态 IP 设置失败: %s", esp_err_to_name(err));
        return;
    }

    esp_netif_dns_info_t dns = {};
    dns.ip.type = ESP_IPADDR_TYPE_V4;
    dns.ip.u_addr.ip4.addr = ip_info.gw.addr;
    err = esp_netif_set_dns_info(netif, ESP_NETIF_DNS_MAIN, &dns);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "DNS 设置: %s", esp_err_to_name(err));
    }

    ESP_LOGI(TAG, "WiFi 已切静态 IP: " IPSTR " mask " IPSTR " gw " IPSTR, IP2STR(&ip_info.ip), IP2STR(&ip_info.netmask),
             IP2STR(&ip_info.gw));
}

void DeepDogOnWifiStaConnected(void* arg, esp_event_base_t base, int32_t id, void* data) {
    (void)arg;
    (void)base;
    (void)id;
    (void)data;
    DeepDogApplyStaticStaIpv4();
}

}  // namespace
#endif  // DEEP_DOG_WIFI_USE_STATIC_IP

#if DEEP_DOG_CAN_ENABLE
#define CAN_RX_TASK_STACK  4096
#define CAN_RX_TASK_PRIO   5
#endif

class SparkBotEs8311AudioCodec : public Es8311AudioCodec {
private:    

public:
    SparkBotEs8311AudioCodec(void* i2c_master_handle, i2c_port_t i2c_port, int input_sample_rate, int output_sample_rate,
                        gpio_num_t mclk, gpio_num_t bclk, gpio_num_t ws, gpio_num_t dout, gpio_num_t din,
                        gpio_num_t pa_pin, uint8_t es8311_addr, bool use_mclk = true)
        : Es8311AudioCodec(i2c_master_handle, i2c_port, input_sample_rate, output_sample_rate,
                             mclk,  bclk,  ws,  dout,  din,pa_pin,  es8311_addr,  use_mclk = true) {}

    void EnableOutput(bool enable) override {
        if (enable == output_enabled_) {
            return;
        }
        if (enable) {
            Es8311AudioCodec::EnableOutput(enable);
        } else {
           // Nothing todo because the display io and PA io conflict
        }
    }
};

class DeepDog : public WifiBoard {
private:
    i2c_bus_handle_t shared_i2c_bus_handle_ = nullptr;
    i2c_master_bus_handle_t i2c_bus_ = nullptr;
    Button boot_button_;
    TouchButtonController touch_buttons_;
    TouchEventHub touch_hub_;
    TouchAppDispatcher touch_dispatcher_{&touch_hub_};
#if DEEP_DOG_TOUCH_COMBO_ENABLE
    TouchComboRecognizer touch_combo_;
#endif
#if DEEP_DOG_TOUCH_APP_LOG_ENABLE
    TouchAppLog touch_app_log_;
#endif
#if DEEP_DOG_DOG_ENABLE
    DogControl dog_;
#if DEEP_DOG_TOUCH_APP_DOG_ENABLE
    TouchAppDog touch_app_dog_{&dog_};
#endif
    LegControl* leg_ptrs_[4] = { nullptr };
#else
#if DEEP_DOG_TOUCH_APP_DOG_ENABLE
    TouchAppDog touch_app_dog_{};
#endif
#endif
#if DEEP_DOG_TOUCH_APP_SERVO_ENABLE
    TouchAppServo touch_app_servo_;
#endif
#if DEEP_DOG_HANDLE_ENABLE
    HandleEventHub handle_hub_;
    HandleAppDispatcher handle_dispatcher_{&handle_hub_};
#if DEEP_DOG_HANDLE_APP_LOG_ENABLE
    HandleAppLog handle_app_log_;
#endif
#if DEEP_DOG_HANDLE_APP_DOG_ENABLE
#if DEEP_DOG_DOG_ENABLE
    HandleAppDog handle_app_dog_{&dog_, &handle_hub_};
#else
    HandleAppDog handle_app_dog_{&handle_hub_};
#endif
#endif
#if DEEP_DOG_HANDLE_APP_SERVO_ENABLE
    HandleAppServo handle_app_servo_;
#endif
#endif
    Display* display_ = nullptr;
    EspVideo* camera_ = nullptr;
#if DEEP_DOG_MOTOR_ENABLE
    DeepMotor* deep_motor_ = nullptr;
#endif
#if DEEP_DOG_CAN_ENABLE && DEEP_DOG_MOTOR_ENABLE
    TaskHandle_t can_rx_task_handle_ = nullptr;
#endif
#if DEEP_DOG_GIMBAL_ENABLE
    Gimbal_t gimbal_{};
#endif
#if DEEP_DOG_IMU_ENABLE
    std::unique_ptr<DeepDogImuSensor> imu_sensor_;
    std::unique_ptr<DeepDogImuSwitch> imu_switch_;
#endif
#if DEEP_DOG_VISION_HUB_ENABLE
    std::unique_ptr<VisionFrameHub> vision_hub_;
#endif
#if DEEP_DOG_HTTP_SERVER_ENABLE
    std::unique_ptr<DeepDogHttpServer> http_server_;
#endif
#if DEEP_DOG_MQTT_ENABLE
    std::unique_ptr<DeepDogMqtt> board_mqtt_;
#endif

#if DEEP_DOG_CAN_ENABLE
    void InitializeCan() {
        ESP32Can.setTxQueueSize(DEEP_DOG_CAN_TX_QUEUE_SIZE);
        ESP32Can.setRxQueueSize(DEEP_DOG_CAN_RX_QUEUE_SIZE);
        bool ok = ESP32Can.begin(
            ESP32Can.convertSpeed(1000),
            (int8_t)CAN_TX_GPIO,
            (int8_t)CAN_RX_GPIO,
            DEEP_DOG_CAN_TX_QUEUE_SIZE,
            DEEP_DOG_CAN_RX_QUEUE_SIZE
        );
        if (ok) {
            ESP_LOGI(TAG, "CAN init ok, TX=%d RX=%d, queue tx=%d rx=%d",
                     (int)CAN_TX_GPIO, (int)CAN_RX_GPIO,
                     (int)DEEP_DOG_CAN_TX_QUEUE_SIZE, (int)DEEP_DOG_CAN_RX_QUEUE_SIZE);
#if DEEP_DOG_CAN_RX_HEX_LOG
            ESP_LOGI(TAG, "CAN RX 报文日志已开启 (DEEP_DOG_CAN_RX_HEX_LOG)");
#endif
#if DEEP_DOG_CAN_TX_HEX_LOG
            ESP_LOGI(TAG, "CAN TX 报文日志已开启 (DEEP_DOG_CAN_TX_HEX_LOG)");
#endif
        } else {
            ESP_LOGE(TAG, "CAN init failed");
        }
    }
#endif

#if DEEP_DOG_CAN_ENABLE && DEEP_DOG_MOTOR_ENABLE
    static void CanRxTask(void* arg) {
        DeepMotor* motor = static_cast<DeepMotor*>(arg);
        CanFrame frame;
        while (1) {
            if (ESP32Can.readFrame(&frame, 50)) {
#if DEEP_DOG_CAN_RX_HEX_LOG
                ESP_LOGI(TAG, "CAN RX ext id=0x%08lX dlc=%u data=%02X %02X %02X %02X %02X %02X %02X %02X",
                         (unsigned long)frame.identifier, (unsigned)frame.data_length_code, frame.data[0],
                         frame.data[1], frame.data[2], frame.data[3], frame.data[4], frame.data[5], frame.data[6],
                         frame.data[7]);
#else
                ESP_LOGD(TAG, "CAN RX id=0x%08lX dlc=%u data=%02X %02X %02X %02X %02X %02X %02X %02X",
                         (unsigned long)frame.identifier, (unsigned)frame.data_length_code, frame.data[0],
                         frame.data[1], frame.data[2], frame.data[3], frame.data[4], frame.data[5], frame.data[6],
                         frame.data[7]);
#endif
                if (motor) {
                    if (motor->processCanFrame(frame)) {
#if DEEP_DOG_CAN_RX_HEX_LOG
                        const uint8_t parsed_motor_id = RX_29ID_DISASSEMBLE_MOTOR_ID(frame.identifier);
                        motor_status_t st = {};
                        if (motor->getMotorStatus(parsed_motor_id, &st) && st.has_feedback) {
                            ESP_LOGI(TAG,
                                     "CAN RX parsed motor=%u pos=%.4f rad speed=%.3f rad/s torque=%.3f N·m temp=%.1f°C seq=%lu",
                                     (unsigned)parsed_motor_id,
                                     (double)st.current_angle,
                                     (double)st.current_speed,
                                     (double)st.current_torque,
                                     (double)st.current_temp,
                                     (unsigned long)st.feedback_seq);
                        }
#endif
                    }
                }
            }
            vTaskDelay(pdMS_TO_TICKS(1));
        }
    }
#endif

#if DEEP_DOG_GIMBAL_ENABLE
    void InitializeGimbal() {
        if (Gimbal_init(&gimbal_, DEEP_DOG_SERVO_PAN_GPIO, DEEP_DOG_SERVO_TILT_GPIO) != ESP_OK) {
            ESP_LOGW(TAG, "Gimbal init failed");
        }
    }
#endif

