deep-diary/xiaozhi-esp32/main/boards/deep-dog/esp_sparkbot_board.cc
    void InitializeExtPinModules() {
        ESP_LOGI(TAG, "ext_pins mode=%s A=%d B=%d can=%d motor=%d dog=%d arm=%d servo=%d gimbal=%d led=%d",
                 DEEP_DOG_EXT_PIN_MODE_STR, (int)DEEP_DOG_EXT_PIN_A_GPIO, (int)DEEP_DOG_EXT_PIN_B_GPIO,
                 DEEP_DOG_CAN_ENABLE, DEEP_DOG_MOTOR_ENABLE, DEEP_DOG_DOG_ENABLE, DEEP_DOG_ARM_ENABLE,
                 DEEP_DOG_SERVO_ENABLE, DEEP_DOG_GIMBAL_ENABLE, DEEP_DOG_LED_ENABLE);
#if DEEP_DOG_UART_ENABLE
        DeepDogUartInit();
#endif
#if DEEP_DOG_RS485_ENABLE
        DeepDogRs485Init();
#endif
#if DEEP_DOG_IO_ENABLE
        DeepDogIoExtInit();
#endif
#if DEEP_DOG_AD_ENABLE
        DeepDogAdInit();
#endif
#if DEEP_DOG_LED_ENABLE
        DeepDogLedInit();
#endif
#if DEEP_DOG_GIMBAL_ENABLE
        InitializeGimbal();
#elif DEEP_DOG_SERVO_ENABLE
        if (DeepDogServoInit() != ESP_OK) {
            ESP_LOGW(TAG, "Servo bank init failed");
        }
#endif
#if DEEP_DOG_ARM_ENABLE
        DeepDogArmInit();
#endif
    }

    void InitializeI2c() {
        // 先建 master bus，再交给 i2c_bus 包装：避免 i2c_bus_v2 探测空端口时刷 ERROR
        i2c_master_bus_config_t bus_cfg = {
            .i2c_port = I2C_NUM_0,
            .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
            .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
            .clk_source = I2C_CLK_SRC_DEFAULT,
            .glitch_ignore_cnt = 7,
            .intr_priority = 0,
            .trans_queue_depth = 0,
            .flags =
                {
                    .enable_internal_pullup = true,
                },
        };
        ESP_ERROR_CHECK(i2c_new_master_bus(&bus_cfg, &i2c_bus_));

        i2c_config_t i2c_cfg = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
            .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
            .sda_pullup_en = GPIO_PULLUP_ENABLE,
            .scl_pullup_en = GPIO_PULLUP_ENABLE,
            .master =
                {
                    .clk_speed = I2C_MASTER_FREQ_HZ,
                },
            .clk_flags = 0,
        };
        shared_i2c_bus_handle_ = i2c_bus_create(I2C_NUM_0, &i2c_cfg);
        if (!shared_i2c_bus_handle_) {
            ESP_LOGE(TAG, "Failed to create shared I2C bus");
            ESP_ERROR_CHECK(ESP_FAIL);
        }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0) && !CONFIG_I2C_BUS_BACKWARD_CONFIG
        i2c_master_bus_handle_t wrapped = i2c_bus_get_internal_bus_handle(shared_i2c_bus_handle_);
        if (wrapped) {
            i2c_bus_ = wrapped;
        }
#else
#error "deep-dog requires i2c_bus_get_internal_bus_handle()"
#endif
        if (!i2c_bus_) {
            ESP_LOGE(TAG, "Failed to obtain master bus handle from i2c_bus");
            ESP_ERROR_CHECK(ESP_FAIL);
        }
    }

    void InitializeSpi() {
        spi_bus_config_t buscfg = {};
        buscfg.mosi_io_num = DISPLAY_MOSI_GPIO;
        buscfg.miso_io_num = GPIO_NUM_NC;
        buscfg.sclk_io_num = DISPLAY_CLK_GPIO;
        buscfg.quadwp_io_num = GPIO_NUM_NC;
        buscfg.quadhd_io_num = GPIO_NUM_NC;
        buscfg.max_transfer_sz = DISPLAY_WIDTH * DISPLAY_HEIGHT * sizeof(uint16_t);
        ESP_ERROR_CHECK(spi_bus_initialize(SPI3_HOST, &buscfg, SPI_DMA_CH_AUTO));
    }

    void InitializeButtons() {
        boot_button_.OnClick([this]() {
            auto& app = Application::GetInstance();
            if (app.GetDeviceState() == kDeviceStateStarting) {
                EnterWifiConfigMode();
                return;
            }
            app.ToggleChatState();
        });
    }

    void InitializeTouchButtons() {
        if (!touch_hub_.Init()) {
            ESP_LOGE(TAG, "TouchEventHub init failed");
            return;
        }

#if DEEP_DOG_TOUCH_COMBO_ENABLE
        touch_dispatcher_.SetComboRecognizer(&touch_combo_);
#if DEEP_DOG_MQTT_ENABLE
        touch_dispatcher_.SetComboHitListener([this](const char* id) {
            if (board_mqtt_) {
                board_mqtt_->NotifyTouchCombo(id);
            }
        });
#endif
#endif
#if DEEP_DOG_TOUCH_APP_LOG_ENABLE
        touch_dispatcher_.Register(&touch_app_log_);
#endif
#if DEEP_DOG_TOUCH_APP_DOG_ENABLE
        touch_dispatcher_.Register(&touch_app_dog_);
#endif
#if DEEP_DOG_TOUCH_APP_SERVO_ENABLE
        touch_dispatcher_.Register(&touch_app_servo_);
#endif

        if (!touch_buttons_.Initialize(
                TOUCH_BUTTON1_GPIO, TOUCH_BUTTON2_GPIO, TOUCH_BUTTON3_GPIO,
                [this](int button_id,
                       TouchButtonEvent event,
                       uint32_t value,
                       uint32_t baseline,
                       uint32_t abs_diff) {
                    TouchEvent ev;
                    ev.button_id = button_id;
                    ev.event = event;
                    ev.value = value;
                    ev.baseline = baseline;
                    ev.abs_diff = abs_diff;
                    ev.pressed_mask = touch_buttons_.GetPressedMask();
                    touch_hub_.Push(ev);
                })) {
            ESP_LOGE(TAG, "Touch button controller init failed");
            return;
        }

        if (!touch_buttons_.LoadThresholdsFromNvs()) {
            ESP_LOGI(TAG, "Touch thresholds: factory defaults (no NVS)");
        }

        if (!touch_dispatcher_.StartPeriodic(DEEP_DOG_TOUCH_DISPATCH_INTERVAL_US)) {
            ESP_LOGE(TAG, "TouchAppDispatcher timer start failed");
        }
    }

#if DEEP_DOG_HANDLE_ENABLE
    void InitializeHandle() {
        if (!handle_hub_.Init()) {
            ESP_LOGE(TAG, "HandleEventHub init failed");
            return;
        }
#if DEEP_DOG_HANDLE_APP_LOG_ENABLE
        handle_dispatcher_.Register(&handle_app_log_);
#endif
#if DEEP_DOG_HANDLE_APP_DOG_ENABLE
        handle_dispatcher_.Register(&handle_app_dog_);
#endif
#if DEEP_DOG_HANDLE_APP_SERVO_ENABLE
        handle_dispatcher_.Register(&handle_app_servo_);
#endif
        if (!handle_dispatcher_.StartPeriodic(DEEP_DOG_HANDLE_DISPATCH_INTERVAL_US)) {
            ESP_LOGE(TAG, "HandleAppDispatcher timer start failed");
        }
#if DEEP_DOG_HANDLE_BT_ENABLE
        if (!HandleBtStart(&handle_hub_)) {
            ESP_LOGE(TAG, "HandleBtStart failed");
        }
#endif
        ESP_LOGI(TAG, "Handle input ready (BT=%d mqtt_input=%d)",
                 DEEP_DOG_HANDLE_BT_ENABLE, DEEP_DOG_HANDLE_MQTT_INPUT_ENABLE);
    }
#endif

    void InitializeDisplay() {
        esp_lcd_panel_io_handle_t panel_io = nullptr;
        esp_lcd_panel_handle_t panel = nullptr;

