deep-diary/xiaozhi-esp32/main/boards/deep-dog/esp_sparkbot_board.cc
        // 液晶屏控制IO初始化
        ESP_LOGD(TAG, "Install panel IO");
        esp_lcd_panel_io_spi_config_t io_config = {};
        io_config.cs_gpio_num = DISPLAY_CS_GPIO;
        io_config.dc_gpio_num = DISPLAY_DC_GPIO;
        io_config.spi_mode = 0;
        io_config.pclk_hz = 40 * 1000 * 1000;
        io_config.trans_queue_depth = 10;
        io_config.lcd_cmd_bits = 8;
        io_config.lcd_param_bits = 8;
        ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi(SPI3_HOST, &io_config, &panel_io));

        // 初始化液晶屏驱动芯片
        ESP_LOGD(TAG, "Install LCD driver");

        esp_lcd_panel_dev_config_t panel_config = {};
        panel_config.reset_gpio_num = GPIO_NUM_NC;
        panel_config.rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB;
        panel_config.bits_per_pixel = 16;
        ESP_ERROR_CHECK(esp_lcd_new_panel_st7789(panel_io, &panel_config, &panel));
        
        esp_lcd_panel_reset(panel);
        esp_lcd_panel_init(panel);
        esp_lcd_panel_invert_color(panel, true);
        esp_lcd_panel_disp_on_off(panel, true);
        display_ = new SpiLcdDisplay(panel_io, panel,
                                    DISPLAY_WIDTH, DISPLAY_HEIGHT, DISPLAY_OFFSET_X, DISPLAY_OFFSET_Y, DISPLAY_MIRROR_X, DISPLAY_MIRROR_Y, DISPLAY_SWAP_XY);
    }

    void InitializeCamera() {

        // DVP pin configuration
        static esp_cam_ctlr_dvp_pin_config_t dvp_pin_config = {
            .data_width = CAM_CTLR_DATA_WIDTH_8,
            .data_io = {
                [0] = SPARKBOT_CAMERA_D0,
                [1] = SPARKBOT_CAMERA_D1,
                [2] = SPARKBOT_CAMERA_D2,
                [3] = SPARKBOT_CAMERA_D3,
                [4] = SPARKBOT_CAMERA_D4,
                [5] = SPARKBOT_CAMERA_D5,
                [6] = SPARKBOT_CAMERA_D6,
                [7] = SPARKBOT_CAMERA_D7,
            },
            .vsync_io = SPARKBOT_CAMERA_VSYNC,
            .de_io = SPARKBOT_CAMERA_HSYNC,
            .pclk_io = SPARKBOT_CAMERA_PCLK,
            .xclk_io = SPARKBOT_CAMERA_XCLK,
        };

        // 复用 I2C 总线
        esp_video_init_sccb_config_t sccb_config = {
            .init_sccb = false,  // 不初始化新的 SCCB，使用现有的 I2C 总线
            .i2c_handle = i2c_bus_,  // 使用现有的 I2C 总线句柄
            .freq = 100000,  // 100kHz
        };

        // DVP configuration
        esp_video_init_dvp_config_t dvp_config = {
            .sccb_config = sccb_config,
            .reset_pin = SPARKBOT_CAMERA_RESET,
            .pwdn_pin = SPARKBOT_CAMERA_PWDN,
            .dvp_pin = dvp_pin_config,
            .xclk_freq = SPARKBOT_CAMERA_XCLK_FREQ,
        };

        // Main video configuration
        esp_video_init_config_t video_config = {
            .dvp = &dvp_config,
        };

        // 触摸/显示等初始化后给 SCCB 与传感器稳定时间；软重启无 PWDN 时更易首读 PID 错乱。
        vTaskDelay(pdMS_TO_TICKS(DEEP_DOG_CAMERA_INIT_DELAY_MS));

        for (int attempt = 1; attempt <= DEEP_DOG_CAMERA_INIT_RETRIES; ++attempt) {
            if (camera_ != nullptr) {
                delete camera_;
                camera_ = nullptr;
            }
            ESP_LOGI(TAG, "Camera init attempt %d/%d", attempt, DEEP_DOG_CAMERA_INIT_RETRIES);
            camera_ = new EspVideo(video_config);
            if (camera_->IsReady()) {
                ESP_LOGI(TAG, "Camera ready on attempt %d", attempt);
                break;
            }
            ESP_LOGW(TAG, "Camera not ready (attempt %d/%d)", attempt, DEEP_DOG_CAMERA_INIT_RETRIES);
            if (attempt < DEEP_DOG_CAMERA_INIT_RETRIES) {
                vTaskDelay(pdMS_TO_TICKS(DEEP_DOG_CAMERA_INIT_RETRY_GAP_MS * attempt));
            }
        }
        if (camera_ == nullptr || !camera_->IsReady()) {
            ESP_LOGE(TAG,
                     "Camera init failed after %d attempts (check power/FPC/XCLK); "
                     "vision hub will idle until power cycle",
                     DEEP_DOG_CAMERA_INIT_RETRIES);
        }

        Settings settings("sparkbot", false);
        // 考虑到部分复刻使用了不可动摄像头的设计，默认启用翻转
        bool camera_flipped = static_cast<bool>(settings.GetInt("camera-flipped", 0));
        ESP_LOGI(TAG, "Camera Flipped: %d", camera_flipped);
        camera_flipped = 1;
        if (camera_ != nullptr) {
            camera_->SetHMirror(camera_flipped);
            camera_->SetVFlip(camera_flipped);
        }
#if DEEP_DOG_TOUCH_APP_DOG_ENABLE
        touch_app_dog_.SetCamera(camera_);
#endif
#if DEEP_DOG_VISION_HUB_ENABLE
        vision_hub_ = std::make_unique<VisionFrameHub>(camera_);
#endif
#if DEEP_DOG_HTTP_SERVER_ENABLE
        // 须在 esp_netif_init / tcpip 就绪之后启动（见 StartNetwork）；勿在构造函数里 httpd_start
#if DEEP_DOG_DOG_ENABLE
        http_server_ = std::make_unique<DeepDogHttpServer>(camera_, &dog_, DEEP_DOG_HTTP_SERVER_PORT);
#else
        http_server_ = std::make_unique<DeepDogHttpServer>(camera_, nullptr, DEEP_DOG_HTTP_SERVER_PORT);
#endif
#if DEEP_DOG_VISION_HUB_ENABLE
        http_server_->SetVisionHub(vision_hub_.get());
#endif
#endif
#if DEEP_DOG_MQTT_ENABLE
        board_mqtt_ = std::make_unique<DeepDogMqtt>();
        board_mqtt_->SetTouchHub(&touch_hub_);
        board_mqtt_->SetTouchController(&touch_buttons_);
#if DEEP_DOG_HANDLE_ENABLE
        board_mqtt_->SetHandleHub(&handle_hub_);
#endif
#if DEEP_DOG_TOUCH_COMBO_ENABLE
        board_mqtt_->SetTouchComboRecognizer(&touch_combo_);
#endif
#if DEEP_DOG_VISION_HUB_ENABLE
        board_mqtt_->SetVisionHub(vision_hub_.get());
#endif
#if DEEP_DOG_HTTP_SERVER_ENABLE
        board_mqtt_->SetHttpServer(http_server_.get());
        board_mqtt_->SetHttpPort(DEEP_DOG_HTTP_SERVER_PORT);
#endif
#endif
    }

    void InitializeImu() {
#if DEEP_DOG_IMU_ENABLE
        if (!shared_i2c_bus_handle_) {
            ESP_LOGW(TAG, "IMU skipped: no I2C bus");
            return;
        }
        imu_sensor_ = std::make_unique<DeepDogImuSensor>(shared_i2c_bus_handle_);
        if (!imu_sensor_->Initialize()) {
            ESP_LOGW(TAG, "BMI270 init failed — MQTT imu/status will publish ok=false");
        } else {
            ESP_LOGI(TAG, "BMI270 ready");
        }
        imu_switch_ = std::make_unique<DeepDogImuSwitch>(imu_sensor_.get());
        if (!imu_switch_->Start()) {
            ESP_LOGW(TAG, "IMU switch sampler failed to start");
        }
#if DEEP_DOG_MQTT_ENABLE
        if (board_mqtt_) {
            board_mqtt_->SetImuSensor(imu_sensor_.get());
            board_mqtt_->SetImuSwitch(imu_switch_.get());
        }
#endif
#endif
    }

    void InitializeTools() {
        auto& mcp_server = McpServer::GetInstance();
#if DEEP_DOG_DOG_ENABLE
        dog_.setDeepMotor(deep_motor_);
        dog_.getLegs(leg_ptrs_);
        RegisterDogMcpTools(mcp_server, &dog_);
#elif DEEP_DOG_MOTOR_ENABLE
        RegisterMotorMcpTools(mcp_server, deep_motor_);
#endif
#if DEEP_DOG_LED_ENABLE
        RegisterLedMcpTools(mcp_server, DeepDogLedGetControl());
#endif
#if DEEP_DOG_SERVO_ENABLE
        RegisterServoMcpTools(mcp_server);
#endif
#if !DEEP_DOG_DOG_ENABLE && !DEEP_DOG_MOTOR_ENABLE && !DEEP_DOG_LED_ENABLE && !DEEP_DOG_SERVO_ENABLE
        (void)mcp_server;
#endif
    }

