deep-diary/xiaozhi-esp32/main/boards/deep-dog/esp_sparkbot_board.cc
public:
    DeepDog() : boot_button_(BOOT_BUTTON_GPIO) {
        InitializeI2c();
        InitializeSpi();
        InitializeDisplay();
        InitializeButtons();
        InitializeTouchButtons();
#if DEEP_DOG_HANDLE_ENABLE
        InitializeHandle();
#endif
        InitializeCamera();
        InitializeExtPinModules();
#if DEEP_DOG_MQTT_ENABLE && DEEP_DOG_LED_ENABLE
        if (board_mqtt_) {
            board_mqtt_->SetLedControl(DeepDogLedGetControl());
        }
#endif
#if DEEP_DOG_CAN_ENABLE
        InitializeCan();
#endif
#if DEEP_DOG_MOTOR_ENABLE
        deep_motor_ = new DeepMotor(nullptr);
#if DEEP_DOG_CAN_ENABLE
        xTaskCreate(CanRxTask, "can_rx", CAN_RX_TASK_STACK, deep_motor_, CAN_RX_TASK_PRIO, &can_rx_task_handle_);
#endif
#endif
        InitializeTools();
        GetBacklight()->RestoreBrightness();
    }

    virtual AudioCodec* GetAudioCodec() override {
         static SparkBotEs8311AudioCodec audio_codec(i2c_bus_, I2C_NUM_0, AUDIO_INPUT_SAMPLE_RATE, AUDIO_OUTPUT_SAMPLE_RATE,
            AUDIO_I2S_GPIO_MCLK, AUDIO_I2S_GPIO_BCLK, AUDIO_I2S_GPIO_WS, AUDIO_I2S_GPIO_DOUT, AUDIO_I2S_GPIO_DIN,
            AUDIO_CODEC_PA_PIN, AUDIO_CODEC_ES8311_ADDR);
        return &audio_codec;
    }

    virtual Display* GetDisplay() override {
        return display_;
    }

    virtual Backlight* GetBacklight() override {
        static PwmBacklight backlight(DISPLAY_BACKLIGHT_PIN, DISPLAY_BACKLIGHT_OUTPUT_INVERT);
        return &backlight;
    }

    virtual Camera* GetCamera() override {
        return camera_;
    }

    void StartNetwork() override {
        WifiBoard::StartNetwork();
#if DEEP_DOG_WIFI_USE_STATIC_IP
        if (s_deep_dog_sta_connected_hook == nullptr) {
            esp_err_t er = esp_event_handler_instance_register(WIFI_EVENT, WIFI_EVENT_STA_CONNECTED, DeepDogOnWifiStaConnected,
                                                               nullptr, &s_deep_dog_sta_connected_hook);
            if (er != ESP_OK) {
                ESP_LOGE(TAG, "注册 STA_CONNECTED 静态 IP: %s", esp_err_to_name(er));
            }
        }
        wifi_ap_record_t ap{};
        if (esp_wifi_sta_get_ap_info(&ap) == ESP_OK) {
            DeepDogApplyStaticStaIpv4();
        }
#endif
        // 等 IP 再启 face/hub/http/mqtt：避免 WiFi/NVS 与 facedb(FAT) 并发踩 flash 断言崩溃，
        // 进而导致摄像头/采帧异常、RTSP 只握手不推帧、MediaMTX 超时掉流。
        {
            std::string ip;
            for (int i = 0; i < 60; ++i) {
                ip = WifiManager::GetInstance().GetIpAddress();
                if (!ip.empty() && ip != "0.0.0.0") {
                    break;
                }
                vTaskDelay(pdMS_TO_TICKS(500));
            }
            if (ip.empty() || ip == "0.0.0.0") {
                ESP_LOGW(TAG, "WiFi IP 超时未就绪，仍继续启动视觉/MQTT");
            } else {
                ESP_LOGI(TAG, "WiFi IP=%s，启动 face/hub/http/mqtt/imu", ip.c_str());
            }
        }
#if DEEP_DOG_IMU_ENABLE
        InitializeImu();
#endif
#if DEEP_DOG_FACE_AI_ENABLE
        if (!DeepDogFaceAiRuntimeStart()) {
            ESP_LOGW(TAG, "人脸 runtime 未启动（静默识别不可用）");
        }
#endif
#if DEEP_DOG_VISION_HUB_ENABLE
        if (vision_hub_ && !vision_hub_->IsRunning()) {
            if (!vision_hub_->Start()) {
                ESP_LOGW(TAG, "VisionFrameHub 启动失败");
            }
        }
#endif
#if DEEP_DOG_HTTP_SERVER_ENABLE
        if (http_server_ && !http_server_->IsRunning()) {
            if (!http_server_->Start()) {
                ESP_LOGW(TAG, "HTTP 控制/MJPEG 服务启动失败（可检查端口占用）");
            }
        }
#endif
#if DEEP_DOG_MQTT_ENABLE
        if (board_mqtt_ && !board_mqtt_->IsRunning()) {
            if (!board_mqtt_->Start()) {
                ESP_LOGW(TAG, "板级 MQTT 首连失败（将后台重连 broker）");
            }
        }
#endif
    }
};

DECLARE_BOARD(DeepDog);
